{
  "name": "Raiden Shogun",
  "element": "electro",
  "icon": "/img/raiden/icon-big.webp",
  "weapon": "POLEARM",
  "rarity": 5,
  "portrait": "/img/raiden/portrait.webp",
  "id": "raiden",
  "talents": [
    {
      "name": "Origin",
      "icon": "/img/raiden/talent-na.webp",
      "type": "normal",
      "description": [],
      "images": [],
      "originalDescription": [
        {
          "text": "Normal Attack"
        },
        {
          "text": "Performs up to 5 consecutive spear strikes."
        },
        {
          "text": "Charged Attack"
        },
        {
          "text": "Consumes a certain amount of Stamina to perform an upward slash."
        },
        {
          "text": "Plunging Attack"
        },
        {
          "text": "Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."
        }
      ]
    },
    {
      "name": "Transcendence: Baleful Omen",
      "icon": "/img/raiden/talent-skill.webp",
      "type": "skill",
      "description": [],
      "images": [],
      "originalDescription": [
        {
          "text": "The Raiden Shogun unveils a shard of her Euthymia, dealing Electro DMG to nearby opponents, and granting nearby party members the Eye of Stormy Judgment."
        },
        {
          "text": ""
        },
        {
          "text": "Eye of Stormy Judgment"
        },
        {
          "text": "When characters with this buff attack and deal DMG to opponents, the Eye will unleash a coordinated attack, dealing AoE Electro DMG at the opponent's position."
        },
        {
          "text": "Characters who gain the Eye of Stormy Judgment will have their Elemental Burst DMG increased based on the Energy Cost of the Elemental Burst during the Eye's duration."
        },
        {
          "text": "The Eye can initiate one coordinated attack every 0.9s per party.Coordinated attacks generated by characters not controlled by you deal 20% of the normal DMG."
        }
      ]
    },
    {
      "name": "Secret Art: Musou Shinsetsu",
      "icon": "/img/raiden/talent-burst.webp",
      "type": "burst",
      "description": [],
      "images": [],
      "originalDescription": [
        {
          "text": "Gathering truths unnumbered and wishes uncounted, the Raiden Shogun unleashes the Musou no Hitotachi and deals AoE Electro DMG, using Musou Isshin in combat for a certain duration afterward. The DMG dealt by Musou no Hitotachi and Musou Isshin's attacks will be increased based on the number of Chakra Desiderata's Resolve stacks consumed when this skill is used."
        },
        {
          "text": ""
        },
        {
          "text": "Musou Isshin"
        },
        {
          "text": "While in this state, the Raiden Shogun will wield her tachi in battle, while her Normal, Charged, and Plunging Attacks will be infused with Electro DMG, which cannot be overridden. When such attacks hit opponents, she will regenerate Energy for all nearby party members. Energy can be restored this way once every 1s, and this effect can be triggered 5 times throughout this skill's duration."
        },
        {
          "text": "While in this state, the Raiden Shogun's resistance to interruption is increased, and she is immune to Electro-Charged reaction DMG."
        },
        {
          "text": "While Musou Isshin is active, the Raiden Shogun's Normal, Charged, and Plunging Attack DMG will be considered Elemental Burst DMG."
        },
        {
          "text": "The effects of Musou Isshin will be cleared when the Raiden Shogun leaves the field."
        },
        {
          "text": ""
        },
        {
          "text": "Chakra Desiderata"
        },
        {
          "text": "When nearby party members (excluding the Raiden Shogun herself) use their Elemental Bursts, the Raiden Shogun will build up Resolve stacks based on the Energy Cost of these Elemental Bursts."
        },
        {
          "text": "The maximum number of Resolve stacks is 60. The Resolve gained by Chakra Desiderata will be cleared 300s after the Raiden Shogun leaves the field."
        }
      ]
    }
  ],
  "passives": [
    {
      "name": "Wishes Unnumbered",
      "icon": "/img/raiden/talent-passive-0.webp",
      "type": "asc1",
      "description": [],
      "originalDescription": [
        {
          "text": "When nearby party members gain Elemental Orbs or Particles, Chakra Desiderata gains 2 Resolve stacks."
        },
        {
          "text": "This effect can occur once every 3s."
        }
      ]
    },
    {
      "name": "Enlightened One",
      "icon": "/img/raiden/talent-passive-1.webp",
      "type": "asc2",
      "description": [],
      "originalDescription": [
        {
          "text": "Each 1% above 100% Energy Recharge that the Raiden Shogun possesses grants her:"
        },
        {
          "text": "0.6% greater Energy restoration from Musou Isshin"
        },
        {
          "text": "0.4% Electro DMG Bonus"
        }
      ]
    },
    {
      "name": "All-Preserver",
      "icon": "/img/raiden/talent-passive-2.webp",
      "type": "utility",
      "description": [],
      "originalDescription": [
        {
          "text": "Mora expended when ascending Swords and Polearms is decreased by 50%."
        }
      ]
    }
  ],
  "constellations": [
    {
      "name": "Ominous Inscription",
      "icon": "/img/raiden/constellation-1.webp",
      "level": 1,
      "description": [],
      "originalDescription": [
        {
          "text": "Chakra Desiderata will gather Resolve even faster. When Electro characters use their Elemental Bursts, the Resolve gained is increased by 80%. When characters of other Elemental Types use their Elemental Bursts, the Resolve gained is increased by 20%."
        }
      ]
    },
    {
      "name": "Steelbreaker",
      "icon": "/img/raiden/constellation-2.webp",
      "level": 2,
      "description": [],
      "originalDescription": [
        {
          "text": "While using Musou no Hitotachi and in the Musou Isshin state applied by Secret Art: Musou Shinsetsu, the Raiden Shogun's attacks ignore 60% of opponents's DEF."
        }
      ]
    },
    {
      "name": "Shinkage Bygones",
      "icon": "/img/raiden/constellation-3.webp",
      "level": 3,
      "description": [
        {
          "text": "Increases Elemental Burst's level by 3."
        },
        {
          "text": "Increases Elemental Burst's max level by 5 (to 15)."
        }
      ],
      "originalDescription": [
        {
          "text": "Increases the Level of Secret Art: Musou Shinsetsu by 3. Maximum upgrade level is 15."
        }
      ]
    },
    {
      "name": "Pledge of Propriety",
      "icon": "/img/raiden/constellation-4.webp",
      "level": 4,
      "description": [],
      "originalDescription": [
        {
          "text": "When the Musou Isshin state applied by Secret Art: Musou Shinsetsu expires, all nearby party members (excluding the Raiden Shogun) gain 30% bonus ATK for 10s."
        }
      ]
    },
    {
      "name": "Shogun's Descent",
      "icon": "/img/raiden/constellation-5.webp",
      "level": 5,
      "description": [
        {
          "text": "Increases Elemental Skill's level by 3."
        },
        {
          "text": "Increases Elemental Skill's max level by 5 (to 15)."
        }
      ],
      "originalDescription": [
        {
          "text": "Increases the Level of Transcendence: Baleful Omen by 3."
        },
        {
          "text": "Maximum upgrade level is 15."
        }
      ]
    },
    {
      "name": "Wishbearer",
      "icon": "/img/raiden/constellation-6.webp",
      "level": 6,
      "description": [],
      "originalDescription": [
        {
          "text": "While in the Musou Isshin state applied by Secret Art: Musou Shinsetsu, attacks by the Raiden Shogun that are considered part of her Elemental Burst will decrease all nearby party members' (but not including the Raiden Shogun herself) Elemental Burst CD by 1s when they hit opponents."
        },
        {
          "text": "This effect can trigger once every 1s, and can trigger a total of 5 times during the state's duration."
        }
      ]
    }
  ]
}